import json

import requests

# cookies = {
#     "LNG": "UA",
#     "_csrf": "c1e6328d4d1a00430f580954cd699bfcb582e349d7cdb35b0fc25fc69f79504fa%3A2%3A%7Bi%3A0%3Bs%3A5%3A%22_csrf%22%3Bi%3A1%3Bs%3A32%3A%22sPIghgsE62pvjuIdspysobQGcw1EBt3j%22%3B%7D",
#     "device-referrer": "https://edrpou.ubki.ua/ua/FO12726884",
#     "device-source": "https://edrpou.ubki.ua/ua/FO14352035",
# }

# headers = {
#     "accept": "*/*",
#     "accept-language": "ru,en;q=0.9,uk;q=0.8",
#     "content-type": "application/x-www-form-urlencoded; charset=UTF-8",
#     # 'cookie': 'LNG=UA; _csrf=c1e6328d4d1a00430f580954cd699bfcb582e349d7cdb35b0fc25fc69f79504fa%3A2%3A%7Bi%3A0%3Bs%3A5%3A%22_csrf%22%3Bi%3A1%3Bs%3A32%3A%22sPIghgsE62pvjuIdspysobQGcw1EBt3j%22%3B%7D; device-referrer=https://edrpou.ubki.ua/ua/FO12726884; device-source=https://edrpou.ubki.ua/ua/FO14352035',
#     "dnt": "1",
#     "origin": "https://edrpou.ubki.ua",
#     "priority": "u=1, i",
#     "referer": "https://edrpou.ubki.ua/ua",
#     "sec-ch-ua": '"Google Chrome";v="131", "Chromium";v="131", "Not_A Brand";v="24"',
#     "sec-ch-ua-mobile": "?0",
#     "sec-ch-ua-platform": '"Windows"',
#     "sec-fetch-dest": "empty",
#     "sec-fetch-mode": "cors",
#     "sec-fetch-site": "same-origin",
#     "user-agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/131.0.0.0 Safari/537.36",
#     "x-csrf-token": "V3braoDaxccc2EIecpi2D4UXNjQf0ylfFHOjHuEk80AkJqIN6L22girqMmgY7f9r9mdPR3CxeBh3BJJbo1DAKg==",
#     "x-requested-with": "XMLHttpRequest",
# }

# params = {
#     "signature": "71cdde7e23dc850751823112839bf8136a186164",
#     "scheme": "cki",
#     "reqid": "",
# }

# data = {
#     "tp": "1",
#     "page": "1",
#     "dr_common_data": "3876303462",
#     "dr_regions": "",
#     "dr_edrstate": "",
#     "dr_kvedcode": "",
#     "dr_search_just": "true",
#     "dr_search_type": "1",
# }

# response = requests.post(
#     "https://edrpou.ubki.ua/srchopenitems",
#     params=params,
#     cookies=cookies,
#     headers=headers,
#     data=data,
#     timeout=30,
# )
# json_data = response.json()
# with open("kyky.json", "w", encoding="utf-8") as f:
#     json.dump(json_data, f, ensure_ascii=False, indent=4)  # Записываем в файл


# def extract_user_name(user_id, user_options):
#     filtered_user = list(filter(lambda x: x["value"] == user_id, user_options))
#     return filtered_user[0]["text"] if filtered_user else None


# def process_data(data):
#     result = []
#     user_options = data["meta"]["fields"]["userId"]["options"]

#     for item in data["data"]:
#         try:
#             entry = {
#                 "id_data": item["id"],
#                 "phone_contact": (
#                     item["contacts"][0]["phone"][0] if item["contacts"] else None
#                 ),
#                 "user_name": extract_user_name(item["userId"], user_options),
#             }
#             result.append(entry)
#         except (KeyError, IndexError) as e:
#             print(f"Ошибка обработки записи: {e}")
#             continue

#     return result


# # Load the JSON data
# with open("kyky.json", "r", encoding="utf-8") as file:
#     data = json.load(file)
# # Использование
# all_data = process_data(data)
# print(all_data)


def find_matching_records(records_bd, records_salesdrive):
    for bd_record in records_bd:
        phone_bd = bd_record["phone"]
        phone_bd_no_prefix = phone_bd[2:] if phone_bd.startswith("38") else phone_bd
        manager_name_bd = bd_record["manager_name"]

        # Будем хранить все совпадения
        matches = []

        # Поиск совпадений по полному номеру
        for sd_record in records_salesdrive:
            if (
                sd_record["phone_contact"] == phone_bd
                and sd_record["user_name"] == manager_name_bd
            ):
                matches.append(sd_record)

        # Поиск совпадений без префикса 38
        if not matches:
            for sd_record in records_salesdrive:
                if (
                    sd_record["phone_contact"] == phone_bd_no_prefix
                    and sd_record["user_name"] == manager_name_bd
                ):
                    matches.append(sd_record)

        # Если нашли совпадения, берем запись с максимальным id_data
        if matches:
            # Сортируем по id_data в убывающем порядке и берем первый элемент
            best_match = max(matches, key=lambda x: x["id_data"])

            formatted_record = {
                "id": best_match["id_data"],
                "data": {"comment": bd_record["notes"]},
            }
            return formatted_record

    # return results


# def update_order_comment(order_data):
#     try:
#         url = "https://zubr.salesdrive.me/api/order/update/"
#         headers = {
#             "Form-Api-Key": "3m7xasIXKX7ME3TmEiN_CU2tajKMEtilHQ-smKeXnSFTKReKV2jEFn8J3TUoYC_aZa-dGQvC-c_NhV9Akl-gCTd-LfGT7v_dZlpe",
#             "Content-Type": "application/json",
#         }

#         logger.info(f"Отправляем запрос на обновление заявки {order_data['id']}")

#         response = requests.post(
#             url,
#             headers=headers,
#             json=order_data,  # requests автоматически сериализует в JSON
#             timeout=(10, 30),  # (connect timeout, read timeout)
#         )

#         logger.info(f"Получен ответ со статусом: {response.status_code}")

#         if response.status_code == 200:
#             return response.json()
#         else:
#             raise Exception(
#                 f"API request failed with status code: {response.status_code}"
#             )

#     except requests.exceptions.Timeout:
#         logger.error("Timeout при запросе к API")
#         raise
#     except Exception as e:
#         logger.error(f"Ошибка при обновлении заявки: {e}")
#         raise


# Пример с несколькими совпадениями:
records_bd = [
    {
        "date": "2025-01-28 10:29:31",
        "phone": "380685634492",
        "manager_name": "Cухотерин Виталий",
        "notes": " Встановлення та налаштування котла (0001 - 0947)\nКлієнт (Анна Петрівна) звернулася до компанії Зубр щодо встановлення котла\nОбговорення знижкового сертифікату на придбання другого котла\nПроблема з коротким димоходом - клієнт вважає його занадто коротким\nСкладнощі з пошуком спеціалістів для встановлення котла\nОбговорення додаткових витрат на комплектуючі (насос, терморегулятор, труби)\nКлієнт висловлює занепокоєння щодо загальної вартості встановлення\n",
    },
    {
        "date": "2025-01-28 10:01:33",
        "phone": "380678518150",
        "manager_name": "Cухотерин Виталий",
        "notes": " Телефонна розмова про котел (0003 - 0123)\nВолодимир (інвалід війни першої групи) отримав пропущений дзвінок\nРозмова стосується котла, який цікавить Володимира\nВолодимир шукає котел, незалежний від електрики\nСпіврозмовник підтверджує, що йдеться про енергонезалежний котел\nДомовлено про перезвон від попереднього консультанта через дві хвилини\n",
    },
    {
        "date": "2025-01-28 09:49:42",
        "phone": "380992487018",
        "manager_name": "Яна Віленська",
        "notes": " Обговорення котлів (0001 - 0139)\nКлієнт цікавиться котлом Прометей шахтного типу на 15 кВт\nЄ два варіанти неутеплений Прометей та утеплений Прометей-люкс\nРозміри топки котла Прометей 39х39х62 см\nКлієнту потрібен котел з більшою топкою для дров довжиною 40-41 см\nЗапропоновано альтернативу - котел Зубр з розмірами топки 40х40 см\nКотел Зубр дорожчий на близько 10 000 грн\n",
    },
    {
        "date": "2025-01-28 09:22:19",
        "phone": "380675044033",
        "manager_name": "Вадим Мишковець",
        "notes": " Обговорення опалювального котла (0006 - 0735)\nКлієнт шукає котел для опалення 340 квадратних метрів\nРекомендовано 30 кВт котел Зуберпро за 44,500 грн\nБезкоштовна доставка курєром до дому\nМожливість оплати при отриманні або в розстрочку\nТовщина сталі котла - 5 мм\nРозміри топки 42х46х92 см, обєм 178 літрів\nДодатковий бункер доступний за 5000-6000 грн\n40 кВт котел також доступний за 46,500 грн\nПопередження про ризики конденсації при використанні занадто потужного котла\nМожливість зафіксувати ціну до кінця року за передоплатою 500 грн\n",
    },
    {
        "date": "2025-01-27 16:55:38",
        "phone": "380968573001",
        "manager_name": "Петро Ким",
        "notes": " Доставка котла (0002 - 0135)\nПетро Харченко з Тростянця очікує доставку котла\nВідправка створена сьогодні, виїзд з Дніпра завтра\nОрієнтовний час доставки - 3 дні\n Процес доставки (0135 - 0255)\nВантажівка забирає товар на складі котлів\nПеревезення до логістичного центру в Дніпропетровській області\nПеревантаження на різні вантажівки для доставки по областях\n Доставка до кінцевого пункту (0255 - 0341)\nРозвантаження в Луцькому районі\nПеревантаження на місцеву доставку\nВодій Нової Пошти звяжеться для уточнення часу доставки\n",
    },
    {
        "date": "2025-01-27 16:40:41",
        "phone": "380996732763",
        "manager_name": "Петро Ким",
        "notes": " Обговорення твердопаливного котла (0015 - 0139)\nКлієнт цікавиться твердопаливним котлом\nЦіна залежить від потужності та моделі котла\nБезкоштовна доставка Новою поштою\nТермін доставки залежить від дати замовлення та наявності котла\n Вибір потужності та моделі (0140 - 0255)\nКлієнт розглядає котел на 15 кВт\nПродавець пропонує різні варіанти шахтні котли Холмова, утилізатор, термо, Зубер Про\nЦіни варіюються від 20 000 до 36 500 грн\nОбговорення різних характеристик утеплення, наявність плити, розмір топки\n Ціни та характеристики (0256 - 0324)\nЗубер-класик 15 кВт без утеплення та плити - 20 000 грн\nЗ плитою - 21 000 грн\nУтеплений з плитою - 23 000 грн\nТрьохдверні моделі з більшою топкою - від 28 500 до 33 500 грн\nПараметри входу-виходу однакові для всіх котлів\n Замовлення та доставка (0325 - 0433)\nКлієнт планує замовити котел сьогодні\nПродавець обіцяє відправити наступного дня\nПопередження про можливе подорожчання котлів через дефіцит сталі в Україні\nПродавець працює з 9 до 18 години щодня\nПропозиція надіслати каталог та сайт через Viber\n",
    },
    {
        "date": "2025-01-27 14:10:19",
        "phone": "380978764152",
        "manager_name": "Яна Віленська",
        "notes": " Обговорення зміни замовлення (0000 - 0107)\nКлієнт погоджується змінити замовлення на модель 15-ка\nНова ціна 21 300 грн без доставки\nПродавець бере на себе вартість накладного платежу\nВідправка замовлення запланована на завтра\nНова модель має більшу топку і довше горіння\n",
    },
    {
        "date": "2025-01-27 13:30:48",
        "phone": "380732325416",
        "manager_name": "Вадим Мишковець",
        "notes": " Консультація щодо котлів (0015 - 0359)\nКлієнт цікавиться котлом для площі до 120 квадратних метрів\nОбговорюються котли Зубер (сталь 5 мм) та Прометей (сталь 3-4 мм)\nПояснюється різниця між шахтним та класичним котлом\nШахтний котел має вище КПД та довший час горіння\nКласичний котел дешевший, швидше набирає температуру, але швидше прогорає\n Вибір котла для будинку (0400 - 0700)\nРекомендується котел Зубер стандарт трьохдверний на 12 кВт за 32 500 грн\nКПД 90, камера 68 літрів, час горіння до 8 годин\nОбговорюються варіанти регуляторів тяги механічний та електронний\nРекомендація щодо використання акумулятора при енергозалежній системі\nОбговорення використання ємності на 500 літрів\n Технічні аспекти системи опалення (0701 - 1000)\nПри використанні ємності 500 л рекомендується котел 20-24 кВт\nПояснюється принцип роботи системи з буферною ємністю\nОбговорюється час роботи системи на одному нагріві ємності (до 8 годин)\nРозглядаються особливості циркуляції води в системі\n Незамерзаюча рідина та потужність котла (1001 - 1354)\nОбговорюється використання незамерзаючої рідини в системі\nРекомендується використовувати незамерзайку на спиртовій основі\nПояснюється необхідність циркуляційного насоса\nРозрахунок потужності котла для системи з буферною ємністю\nРекомендована потужність котла - 20 кВт для ефективної роботи\n",
    },
    {
        "date": "2025-01-27 12:40:16",
        "phone": "380509733537",
        "manager_name": "Cухотерин Виталий",
        "notes": " Початковий контакт (0002 - 0037)\nДзвінок до компанії Котел Зубер\nПідтвердження, що компанія продає твердопаливні котли\nКомпанія є виробником та продавцем котлів\n Питання про точки продажу (0021 - 0037)\nУ компанії немає фізичних точок продажу чи шоурумів\nЄдиний завод-виробник знаходиться в Дніпрі\n Пропозиція співпраці (0040 - 0130)\nКомпанія Імпульс Плюс виробляє гранули для твердопаливних котлів\nПропозиція розмістити їхні гранули на сайті Котел Зубер\nПредставник Котел Зубер не приймає рішення самостійно\n Попередній контакт (0107 - 0125)\nЗгадка про попередній дзвінок 23-го числа\nУточнення щодо результатів попереднього спілкування\n Завершення розмови (0125 - 0151)\nПредставник Котел Зубер обіцяє передати інформацію керівництву\nДомовленість про зворотній дзвінок\n",
    },
    {
        "date": "2025-01-27 11:10:57",
        "phone": "380504611860",
        "manager_name": "Яна Віленська",
        "notes": " Обговорення рахунків (0001 - 0053)\nОтримано два рахунки за буферну ємність 12500 і 10000 грн\nЗагальна вартість буферної ємності - 22500 грн\nПитання щодо вартості 30100 грн\n Пояснення щодо буфера та бойлера (0054 - 0144)\nБуфер і бойлер - різні товари\nБуфер - бочка на 1000 літрів, вартість 22500 грн\nБойлер непрямого нагріву на 150 літрів, вартість 30100 грн\nВнесено передоплату за буфер 100, за бойлер - 12100 грн\n Характеристики бойлера (0145 - 0222)\nБойлер-косвенник спеціальний для опалення та гарячого водопостачання\nМає електричний ТЕН та змійовик\nЦе найдорожчий бойлер з усіма функціями\n Завершення розмови (0223 - 0252)\nПрохання уважно переглянути інформацію у Viber\nБойлер вже забрано\nБуферна ємність на тонну та насос прибули\n",
    },
    {
        "date": "2025-01-27 10:53:33",
        "phone": "380951483349",
        "manager_name": "Вадим Мишковець",
        "notes": " Проблема з оплатою (0000 - 0026)\nКлієнт не може здійснити оплату\nЗапропоновано альтернативні варіанти оплати\nЗгадано про точку оплати в Дергачах, але це незручно для клієнта\n Рекомендації щодо вирішення проблеми (0027 - 0051)\nРекомендовано звязатися з LiqPay для вирішення проблеми\nЗапропоновано показати помилку службі підтримки LiqPay\nОбговорено можливість повторного створення посилання для оплати\n Додаткові деталі та спроби вирішення (0052 - 0121)\nПеревірено авторизацію клієнта\nЗгадано про попередні спроби звязатися з банком\nРекомендовано наполегливо вирішувати питання з LiqPay\nЗапропоновано голосовий звязок з LiqPay для швидшого вирішення проблеми\n",
    },
    {
        "date": "2025-01-27 10:03:05",
        "phone": "380988716926",
        "manager_name": "Яна Віленська",
        "notes": " Вибір котла для опалення (0001 - 0505)\nКлієнт шукає котел для опалення 120 кв.м\nРекомендовано класичний котел без плити\nЗапропоновано модель Zuber Classic Thermo 15 кВт\nЦіна 22 500 грн, безкоштовна доставка\nКотел підходить для одного поверху, не для двох\n Технічні характеристики та гарантія (0505 - 0935)\nТовщина топки 5 мм, теплообмінники 3-3,5 мм\nГарантія 5 років на герметичність котла\nВаріанти вирішення проблем ремонт на заводі або компенсація ремонту на місці\n Доставка та комплектація (0935 - 1300)\nДоставка до Тернополя займе близько 3 днів\nБазова комплектація без автоматики\nЦіна з турбіною 27 000 грн\nДіаметр димоходу 130 мм\nВисота котла 81 см\n",
    },
    {
        "date": "2025-01-27 10:10:54",
        "phone": "380954987461",
        "manager_name": "Cухотерин Виталий",
        "notes": " Обговорення котла (0001 - 0108)\nКлієнт шукає котел на 120 квадратних метрів\nЗапит на шестерку метал\nКомпанія Зубер з міста Дніпро\nОбговорення моделі Зуберпрайм 12 кВт\nКлієнт цікавиться димоходом\n Ціна та характеристики (0109 - 0150)\n16 кВт котел доступний замість 12 кВт\nКотел 16 кВт підходить для площі до 160 кв.м.\nЦіна котла 49 тисяч гривень\nКлієнт вважає ціну високою\n Доставка та додаткова інформація (0151 - 0228)\nБезкоштовна доставка Новою Поштою\nМожлива адресна доставка додому\nПродавець погоджується надіслати фотографії котла на Viber\n",
    },
    {
        "date": "2025-01-27 09:50:04",
        "phone": "380990510438",
        "manager_name": "Вадим Мишковець",
        "notes": " Обговорення котла (0001 - 0138)\nДовжина дров для котла - максимум 42 см, оптимально - 40 см\nОбговорюється 16-кіловатний котел Zuber Standard\nЦіна котла - 33 500 грн\nРозрахунок щомісячного платежу при розстрочці на 6 місяців 5583,33 грн\n Оплата частинами (0139 - 0243)\nОформлення через додаток Приват24\nПроцес отримання рахунку, авторизація, підтвердження операції\nПерший платіж - 16 від суми, банк перераховує повну вартість продавцю\nНаступні платежі знімаються щомісячно\n Доставка та завершення розмови (0244 - 0324)\nБезкоштовна доставка Новою Поштою в будь-яку точку України\nКлієнт планує порадитися та перетелефонувати для прийняття рішення\n",
    },
    {
        "date": "2025-01-27 09:17:18",
        "phone": "380674050931",
        "manager_name": "Вадим Мишковець",
        "notes": " Обговорення котла Зубр (0002 - 0037)\nКлієнт цікавиться котлом Зубр, класик, термо\nКотел має електронний датчик температури на батарейках, розташований вгорі\n Замовлення та оплата (0037 - 0125)\nКлієнт хоче замовити котел з доставкою та попередньою оплатою\nПотужність котла 10 кіловат\nВихід димоходу ззаду\nМеханічний регулятор тяги не входить в базову комплектацію\nЦіни на регулятори тяги чеський - 900 грн, італійський - 1500 грн\n Акції та знижки (0125 - 0218)\nБезкоштовна доставка\nЗнижка 1000 грн або подарунок регулятора тяги для УБД\nЗнижковий сертифікат на 1000 грн від друзівродичів, які мають котел\n Деталі замовлення та доставки (0218 - 0323)\nБезкоштовна доставка додому\nМожливість накладеного платежу без передоплати\nЦіна котла 10 кВт утепленого без плити 2510 грн\nКомплектація термометр, совок, кочерга, зольний ящик, колосники, чавуні\n",
    },
    {
        "date": "2025-01-28 11:12:03",
        "phone": "380967420405",
        "manager_name": "Яна Віленська",
        "notes": " Обговорення котла (0001 - 0118)\nКлієнт цікавиться ціною на котел потужністю 12 кВт\nЦіна котла - 25 500 грн\nКлієнт потребує котел з трубою зверху\nПродавець пропонує котел з трьохходовим теплообмінником, але труба ззаду\nОбговорюється можливість використання коліна для виведення труби наверх\nПродавець пропонує альтернативну модель з одним полочним теплообмінником\nКлієнт наполягає на трьохуровневому котлі\nУ продавця немає моделі з димоходом зверху, тільки ззаду\n",
    },
    {
        "date": "2025-01-28 11:43:32",
        "phone": "380663550219",
        "manager_name": "Cухотерин Виталий",
        "notes": " Обговорення котла для парника (0000 - 0128)\nКлієнт шукає недорогий котел для парника\nПлоща обігріву 600 м²\nДва парники розміром 30x7 м та один 5x5 м\nЗагальна площа обігріву 450 м² по землі\n Технічні деталі (0129 - 0249)\nСистема опалення труби по землі\nРекомендовано котел потужністю 50-70 кВт\nКлієнт розглядає використання труб 40 мм або 32 мм\n Обговорення цін (0250 - 0422)\n70 кВт котел 75000 грн\n55 кВт котел 65500 грн\n100 кВт котел 88500 грн\nКлієнт цікавиться простішими і дешевшими варіантами\nПродавець пропонує безкоштовну доставку та можливі знижки\n",
    },
    {
        "date": "2025-01-28 14:59:32",
        "phone": "380978203613",
        "manager_name": "Вадим Мишковець",
        "notes": " Обговорення твердопаливного котла (0000 - 0144)\nКлієнт шукає твердопаливний котел потужністю 10 кВт\nВажливі вимоги до розмірів висота не більше 95 см, ширина 35 см, глибина 42 см\nЗапропоновано котел Прометей за ціною 13 900 грн\nБезкоштовна доставка\nГабарити запропонованого котла 70x38x41 см\n Проблема з розмірами (0144 - 0243)\nКлієнту потрібна висота котла 92-93 см\nЗапропоновані моделі (Прометей, Зубр Класик) занадто низькі\nРозглянуто варіант Зубр Еко (висота 84 см) за 26 500 грн\nЗубр Стандарт (висота 1 м) за 32 500 грн - занадто дорогий для клієнта\n Пошук альтернатив (0243 - 0351)\nКлієнт не може знайти підходящий котел у місцевих магазинах\nКомпанія пропонує тільки власні моделі (Зубр, Прометей)\nРекомендовано шукати інші виробники та моделі через інтернет\n",
    },
    {
        "date": "2025-01-28 15:18:01",
        "phone": "380982920618",
        "manager_name": "Cухотерин Виталий",
        "notes": " Обговорення котла Зубр (0002 - 0030)\nКлієнт цікавиться котлом Зубр зеленого кольору\nРозглядається модель потужністю 25 кВт\nУточнюється, який саме варіант Зубр термо, Зубр міні чи Зубр про\n Ціна та доставка (0032 - 0100)\nВартість котла - 31 500 грн\nБезкоштовна доставка прямо на адресу клієнта\n Планування покупки (0105 - 0152)\nКлієнт планує звязатися після 15 лютого для уточнення адреси доставки\nПропозиція зробити передоплату 500 грн для фіксації ціни\nКлієнт вирішує звязатися 16 лютого для остаточної домовленості\n Умови оплати та контакти (0152 - 0216)\nОплата при отриманні товару\nОбмін контактними даними через Viber\nПредставлення продавець - Віталій, клієнт - Микола\n",
    },
    {
        "date": "2025-01-28 16:22:27",
        "phone": "380508525375",
        "manager_name": "Вадим Мишковець",
        "notes": " Запит щодо знижки на котел (0001 - 0037)\nКлієнт купував котел три роки тому\nОтримав скидочний сертифікат на 1000 гривень\nЦікавиться можливістю використання знижки на новий котел\n Підтвердження знижки та ціни (0037 - 0054)\nЗнижка в 1000 гривень дійсна на продукцію Zubr\nКотел 16 стандарт на 3,20 коштує 33,500 грн\nЗі знижкою ціна становитиме 32,500 грн\n Процедура замовлення (0054 - 0124)\nКлієнт має продиктувати номер сертифіката при замовленні\nСертифікат безстроковий, можна активувати в будь-який час\nРобочі години з 9 ранку до 6 вечора, включаючи вихідні\n",
    },
]

records_salesdrive = [
    {"id_data": 8317, "phone_contact": "0508525375", "user_name": "Вадим Мишковець"},
    {"id_data": 8316, "phone_contact": "380938659276", "user_name": "Яна Віленська"},
    {
        "id_data": 8315,
        "phone_contact": "380982920618",
        "user_name": "Виталий Сухотерин",
    },
    {"id_data": 8314, "phone_contact": "380682920618", "user_name": "Вадим Мишковець"},
    {"id_data": 8312, "phone_contact": "380978203613", "user_name": "Вадим Мишковець"},
    {"id_data": 8311, "phone_contact": "0673105942", "user_name": None},
    {"id_data": 8310, "phone_contact": "380996183139", "user_name": "Яна Віленська"},
    {"id_data": 8309, "phone_contact": "380685407854", "user_name": "Яна Віленська"},
    {
        "id_data": 8308,
        "phone_contact": "380683630284",
        "user_name": "Виталий Сухотерин",
    },
    {"id_data": 8307, "phone_contact": "380683452617", "user_name": "Яна Віленська"},
    {
        "id_data": 8306,
        "phone_contact": "380663550219",
        "user_name": "Виталий Сухотерин",
    },
    {"id_data": 8304, "phone_contact": "380661560658", "user_name": "Вадим Мишковець"},
    {"id_data": 8303, "phone_contact": "380986043549", "user_name": "Яна Віленська"},
    {"id_data": 8302, "phone_contact": "380681234458", "user_name": "Яна Віленська"},
    {"id_data": 8301, "phone_contact": "380675044033", "user_name": "Вадим Мишковець"},
    {"id_data": 8300, "phone_contact": "380673927728", "user_name": "Вадим Мишковець"},
    {"id_data": 8299, "phone_contact": "380684950550", "user_name": "Вадим Мишковець"},
    {"id_data": 8297, "phone_contact": "380663797787", "user_name": "Вадим Мишковець"},
    {"id_data": 8296, "phone_contact": "380732325416", "user_name": "Вадим Мишковець"},
    {"id_data": 8295, "phone_contact": "0954364619", "user_name": "Виталий Сухотерин"},
    {"id_data": 8294, "phone_contact": "0954364619", "user_name": "Виталий Сухотерин"},
    {"id_data": 8293, "phone_contact": "0954364619", "user_name": "Виталий Сухотерин"},
    {"id_data": 8292, "phone_contact": "380978764152", "user_name": "Яна Віленська"},
    {"id_data": 8291, "phone_contact": "0954465801", "user_name": "Вадим Мишковець"},
    {"id_data": 8290, "phone_contact": "0674050931", "user_name": "Яна Віленська"},
    {
        "id_data": 8289,
        "phone_contact": "380954987461",
        "user_name": "Виталий Сухотерин",
    },
    {"id_data": 8288, "phone_contact": "380506087366", "user_name": "Вадим Мишковець"},
    {"id_data": 8287, "phone_contact": "0969924733", "user_name": "Виталий Сухотерин"},
    {"id_data": 8286, "phone_contact": "0992767204", "user_name": "Виталий Сухотерин"},
    {"id_data": 8285, "phone_contact": "0985387477", "user_name": "Вадим Мишковець"},
    {"id_data": 8284, "phone_contact": "380992694213", "user_name": "Вадим Мишковець"},
    {"id_data": 8283, "phone_contact": "380976909760", "user_name": "Вадим Мишковець"},
    {"id_data": 8282, "phone_contact": "380969028059", "user_name": "Яна Віленська"},
    {"id_data": 8281, "phone_contact": "380674050931", "user_name": "Вадим Мишковець"},
    {"id_data": 8280, "phone_contact": "0976577174", "user_name": "Вадим Мишковець"},
    {"id_data": 8279, "phone_contact": "380988716926", "user_name": "Яна Віленська"},
    {"id_data": 8278, "phone_contact": "0675484722", "user_name": "Яна Віленська"},
    {"id_data": 8277, "phone_contact": "380637654279", "user_name": "Яна Віленська"},
]

result = find_matching_records(records_bd, records_salesdrive)
print(result)  # Вернет запись с id_data: 8320, так как это максимальный id
# Вывод: [{"id": 8317, "data": {"comment": "notes"}}]
